[
  {
    "id": "cs-solarwinds-001",
    "title": "SolarWinds Supply Chain Attack (SUNBURST)",
    "incidentType": "apt",
    "dateRange": "2020 Q1 - 2021 Q2",
    "summary": "A sophisticated supply chain attack impacting SolarWinds Orion platform, allowing attackers to compromise thousands of organizations worldwide, including government agencies and Fortune 500 companies.",
    "attackChain": "<h3>Phase 1: Initial Compromise & Supply Chain Injection</h3><p>Attackers injected malicious code (SUNBURST backdoor) into SolarWinds Orion software updates. This was a highly stealthy operation, blending the malicious code with legitimate updates.</p><ul><li><strong>Method:</strong> Supply Chain Attack</li><li><strong>Initial Vector:</strong> Compromised SolarWinds build environment</li></ul><h3>Phase 2: Distribution & Foothold</h3><p>Victim organizations downloaded the trojanized Orion updates, which established a backdoor. The malware remained dormant for up to two weeks before activating.</p><ul><li><strong>Delivery:</strong> Legitimate software update</li><li><strong>Persistence:</strong> Implanted backdoor within Orion software</li></ul><h3>Phase 3: Lateral Movement & Data Exfiltration</h3><p>Once active, SUNBURST allowed attackers to escalate privileges, move laterally within victim networks, and steal sensitive data, including emails and intellectual property. Attackers often used compromised credentials to access cloud environments like Microsoft 365.</p><ul><li><strong>Techniques:</strong> Credential theft, Golden SAML, Lateral Movement, Cloud environment compromise</li><li><strong>Impact:</strong> Data exfiltration, espionage</li></ul>",
    "osintTechniquesUsed": ["DNS Recon", "WHOIS Lookup", "Public Records", "Threat Intelligence Platform Analysis", "Domain Squatting Checks"],
    "toolsUsed": ["VirusTotal", "Shodan", "Passive DNS tools", "Public record databases", "Threat intelligence platforms"],
    "lessonsLearned": "<p>This case study highlights the severe risks of supply chain attacks and the importance of robust security practices across the entire software development lifecycle.</p><ul><li><strong>Supply Chain Security:</strong> Implement strict vetting and continuous monitoring of third-party software and чуюvendors.</li><li><strong>Zero Trust Architecture:</strong> Adopt a zero-trust model where no entity is inherently trusted, regardless of its location.</li><li><strong>MFA & Endpoint Detection:</strong> Enforce multi-factor authentication everywhere and deploy advanced endpoint detection and response (EDR) solutions.</li><li><strong>Threat Hunting:</strong> Actively hunt for anomalous behavior, even when traditional security alerts are quiet.</li><li><strong>Log Analysis:</strong> Centralize and analyze logs from all systems, including cloud services, for suspicious activity.</li></ul>",
    "threatActor": "APT29 (UNC2452 / Nobelium)",
    "difficulty": "advanced",
    "tags": ["apt", "supply-chain", "espionage", "government", "microsoft", "orion"],
    "starred": true,
    "pinned": false,
    "addedDate": "2021-03-10T09:00:00Z"
  },
  {
    "id": "cs-phishing-xyz-002",
    "title": "Phishing Attack on Healthcare Provider",
    "incidentType": "phishing",
    "dateRange": "2024-05-15",
    "summary": "A targeted phishing campaign delivered ransomware disguised as urgent medical invoices, impacting a small regional healthcare provider and encrypting patient records.",
    "attackChain": "<h3>Phase 1: Spear Phishing</h3><p>Attackers crafted highly personalized emails targeting administrative staff, using publicly available information about the healthcare provider.</p><ul><li><strong>Method:</strong> Spear Phishing</li><li><strong>Lure:</strong> Fake medical invoice attached</li></ul><h3>Phase 2: Malware Delivery & Execution</h3><p>An attached malicious PDF (containing embedded malware) was opened by an unsuspecting employee. The malware then executed, initiating the ransomware payload.</p><ul><li><strong>Payload:</strong> Ransomware variant (e.g., Conti, LockBit)</li><li><strong>Execution:</strong> Malicious document macro/exploit</li></ul><h3>Phase 3: Encryption & Extortion</h3><p>The ransomware rapidly encrypted critical patient databases and internal network shares. Attackers demanded a cryptocurrency payment for decryption keys.</p><ul><li><strong>Impact:</strong> Data encryption, operational disruption, extortion</li></ul>",
    "osintTechniquesUsed": ["Email Header Analysis", "Domain Reputation Checks", "Social Media Scanning (for employee info)", "Public Records (for business contacts)"],
    "toolsUsed": ["MXToolbox", "VirusTotal", "Have I Been Pwned", "URLVoid", "Email security gateways"],
    "lessonsLearned": "<p>This case highlights the ongoing threat of phishing, especially against vulnerable sectors like healthcare.</p><ul><li><strong>Employee Training:</strong> Regular and effective cybersecurity awareness training for all staff.</li><li><strong>Email Filtering:</strong> Implement robust email security solutions with advanced threat detection.</li><li><strong>Backup Strategy:</strong> Maintain frequent, offline, and immutable backups of critical data.</li><li><strong>Incident Response Plan:</strong> Have a well-tested incident response plan specifically for ransomware attacks.</li><li><strong>Network Segmentation:</strong> Segment networks to limit lateral movement in case of a breach.</li></ul>",
    "threatActor": "Unattributed Cybercriminal Group",
    "difficulty": "intermediate",
    "tags": ["ransomware", "healthcare", "phishing", "cybercrime", "data-encryption"],
    "starred": false,
    "pinned": true,
    "addedDate": "2024-05-20T14:30:00Z"
  },
  {
    "id": "cs-insider-003",
    "title": "Insider Threat: Data Exfiltration by Disgruntled Employee",
    "incidentType": "insider-threat",
    "dateRange": "2023-11-01 to 2024-01-20",
    "summary": "A disgruntled former employee exfiltrated sensitive customer data before leaving the company, using unauthorized cloud storage services.",
    "attackChain": "<h3>Phase 1: Unauthorized Access & Data Collection</h3><p>The employee, while still employed, accessed internal databases beyond their normal job function, collecting customer records.</p><ul><li><strong>Method:</strong> Privilege Abuse</li><li><strong>Source:</strong> Internal Database, CRM system</li></ul><h3>Phase 2: Data Staging & Obfuscation</h3><p>Data was copied to local machine, compressed, and sometimes renamed to evade detection before being uploaded to personal cloud accounts.</p><ul><li><strong>Techniques:</strong> Data compression, renaming files</li><li><strong>Tools:</strong> WinRAR, standard OS tools</li></ul><h3>Phase 3: Exfiltration</h3><p>Sensitive data was uploaded to a personal cloud storage service (e.g., Dropbox, Google Drive) over several weeks, often outside business hours.</p><ul><li><strong>Vector:</strong> Cloud storage (e.g., Dropbox, Google Drive)</li><li><strong>Timing:</strong> Off-hours activity</li></ul><h3>Phase 4: Post-Termination Access Attempt</h3><p>Attempts to access internal systems were detected from the former employee's home IP address post-termination, triggering alarms and leading to forensic investigation.</p><ul><li><strong>Detection:</strong> Failed login attempts, IP monitoring</li></ul>",
    "osintTechniquesUsed": ["Employee Social Media Monitoring (public info)", "Email Address Recon (for personal accounts)", "IP Geolocation", "Domain/Cloud Provider WHOIS"],
    "toolsUsed": ["OSINT Tools for social media search", "IP lookup tools", "Cloud service provider terms of service analysis"],
    "lessonsLearned": "<p>Insider threats are difficult to detect but often leave digital breadcrumbs.</p><ul><li><strong>DLP (Data Loss Prevention):</strong> Implement and configure DLP solutions to monitor and block unauthorized data transfers to cloud services.</li><li><strong>UBA (User Behavior Analytics):</strong> Deploy UBA tools to detect anomalous user behavior (e.g., accessing unusual files, large data transfers).</li><li><strong>Strict Access Controls:</strong> Implement least privilege and role-based access control, regularly reviewing permissions.</li><li><strong>Offboarding Procedures:</strong> Ensure immediate revocation of all access upon employee termination.</li><li><strong>Log Monitoring:</strong> Continuously monitor and alert on unusual login patterns or access attempts from former employees.</li></ul>",
    "threatActor": "Disgruntled Employee (Internal)",
    "difficulty": "intermediate",
    "tags": ["insider-threat", "data-exfiltration", "cloud-security", "privilege-abuse", "forensics"],
    "starred": true,
    "pinned": true,
    "addedDate": "2024-02-01T10:00:00Z"
  },
  {
    "id": "cs-ddos-cloud-004",
    "title": "DDoS Attack on E-commerce Platform",
    "incidentType": "ddos",
    "dateRange": "2024-04-10",
    "summary": "A large-scale volumetric DDoS attack disrupted a major e-commerce platform's services for several hours, leading to significant revenue loss.",
    "attackChain": "<h3>Phase 1: Reconnaissance</h3><p>Attackers identified the platform's public-facing IP addresses and DNS infrastructure.</p><ul><li><strong>Method:</strong> Network Scanning, DNS Enumeration</li></ul><h3>Phase 2: Attack Launch</h3><p>A botnet was leveraged to flood the platform's servers with massive amounts of traffic (SYN floods, UDP floods, HTTP floods).</p><ul><li><strong>Vector:</strong> Volumetric DDoS, Application-layer DDoS</li><li><strong>Tools:</strong> Botnet-as-a-service</li></ul><h3>Phase 3: Service Disruption</h3><p>The platform's infrastructure was overwhelmed, leading to service outages, slow response times, and inability for legitimate users to access the website.</p><ul><li><strong>Impact:</strong> Revenue loss, reputational damage, operational downtime</li></ul><h3>Phase 4: Mitigation & Recovery</h3><p>Cloud-based DDoS mitigation services were activated, filtering malicious traffic and restoring normal operations.</p><ul><li><strong>Techniques:</strong> Traffic scrubbing, rate limiting, IP blacklisting</li><li><strong>Tools:</strong> Cloudflare, Akamai, AWS Shield</li></ul>",
    "osintTechniquesUsed": ["DNS History Lookup", "IP Reputation Check", "Attack Surface Mapping"],
    "toolsUsed": ["Censys", "Shodan", "AbuseIPDB", "Whois.com"],
    "lessonsLearned": "<p>DDoS attacks remain a potent threat, emphasizing the need for robust mitigation strategies.</p><ul><li><strong>DDoS Mitigation Services:</strong> Implement always-on or on-demand cloud-based DDoS protection.</li><li><strong>Network Architecture:</strong> Design resilient networks with sufficient bandwidth and redundancy.</li><li><strong>Incident Response:</strong> Have a clear DDoS incident response plan, including communication protocols.</li><li><strong>Traffic Monitoring:</strong> Continuously monitor network traffic for anomalous patterns.</li><li><strong>Edge Protection:</strong> Utilize WAFs and CDNs to distribute traffic and filter malicious requests at the edge.</li></ul>",
    "threatActor": "Unidentified Cyber Extortion Group",
    "difficulty": "intermediate",
    "tags": ["ddos", "e-commerce", "cyberattack", "volumetric", "application-layer"],
    "starred": false,
    "pinned": false,
    "addedDate": "2024-04-12T11:00:00Z"
  },
  {
    "id": "cs-ransomware-supply-chain-005",
    "title": "Ransomware via Managed Service Provider (MSP)",
    "incidentType": "ransomware",
    "dateRange": "2023-09-01",
    "summary": "Multiple small businesses were hit by ransomware after a Managed Service Provider (MSP) they used was compromised, leading to a supply chain attack.",
    "attackChain": "<h3>Phase 1: MSP Compromise</h3><p>Attackers exploited a vulnerability in the MSP's remote monitoring and management (RMM) software or gained access via phishing credentials.</p><ul><li><strong>Method:</strong> Supply Chain Attack (MSP), Credential Theft</li><li><strong>Initial Vector:</strong> RMM software vulnerability/compromise</li></ul><h3>Phase 2: Lateral Movement to Clients</h3><p>Using the compromised MSP access, attackers deployed ransomware across multiple client networks, leveraging the trusted relationship.</p><ul><li><strong>Vector:</strong> MSP's legitimate access to client systems</li><li><strong>Payload:</strong> Ryuk, Conti, or similar ransomware strains</li></ul><h3>Phase 3: Data Encryption & Extortion</h3><p>Client data was encrypted, and ransom notes were deployed across affected systems. The MSP and its clients faced simultaneous operational shutdowns.</p><ul><li><strong>Impact:</strong> Widespread data encryption, business interruption, reputational damage for MSP</li></ul><h3>Phase 4: Complex Recovery</h3><p>Recovery involved coordinating efforts between the compromised MSP and all affected clients, often leading to prolonged downtime and high recovery costs.</p><ul><li><strong>Challenge:</strong> Multi-tenant recovery, trust erosion</li></ul>",
    "osintTechniquesUsed": ["MSP Public Information", "Vulnerability Databases (for RMM software)", "Dark Web Monitoring (for ransomware group comms)"],
    "toolsUsed": ["Shodan (for RMM instances)", "CVE Databases", "Recorded Future (for threat intel)"],
    "lessonsLearned": "<p>The case demonstrates the cascading effects of supply chain compromises involving trusted third parties like MSPs.</p><ul><li><strong>Third-Party Risk Management:</strong> Rigorous vetting and continuous monitoring of MSPs and other critical vendors.</li><li><strong>Network Segmentation:</strong> Isolate MSP management tools and accounts within your network.</li><li><strong>MFA for All Access:</strong> Enforce MFA for all remote access and privileged accounts.</li><li><strong>Rapid Incident Response:</strong> Develop plans for responding to supply chain attacks, involving external partners.</li><li><strong>Client-Side Protections:</strong> Clients should still maintain their own endpoint detection and response (EDR) and robust backup solutions independent of the MSP.</li></ul>",
    "threatActor": "Ransomware-as-a-Service (RaaS) affiliates",
    "difficulty": "advanced",
    "tags": ["ransomware", "supply-chain", "msp", "ryuk", "conti", "business-interruption"],
    "starred": true,
    "pinned": false,
    "addedDate": "2023-09-05T09:00:00Z"
  }
]